### 데이터 병합 
- concat, merge
- axis 축을 뜻함
- ignore_index 인덱스를 사용할 것인지, 혹은 새로운 인텍스를 사용할 것인지?

In [1]:
## concat
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[7,8], "B":[9,10]})

In [5]:
pd.concat([df1, df2],axis =0, ignore_index= True) #axis=0 세로로 병합

   A   B
0  1   4
1  2   5
2  3   6
3  7   9
4  8  10

In [6]:
pd.concat([df1, df2],axis =0, ignore_index= False) # 인덱스 그대로

   A   B
0  1   4
1  2   5
2  3   6
0  7   9
1  8  10

In [7]:
pd.concat([df1, df2],axis =1, ignore_index= True) # axis=1 가로로 병합

   0  1    2     3
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

## merge
- 두 개의 데이터 프레임을 조인(join)하는 함수

- 공통된 컬럼을 기준으로 데이터프레임을 병합한다.

- left : 병합할 첫 번재 데이터프레임이고, 왼쪽 데이터프레임

- right : 병합할 두 번째 데이터프레임,. 오른쪽 데이터프레임

- on : 조인키로 사용할 컬럼 목록, 여기에 입력된 컬럼이 두 데이터프레임에 포함되어야 한다.

- left_on : 왼쪽 데이터프레임에서 조인 키로 사용할 컬럼 목록

- right_on : 오른쪽 동일

- left_index : 왼쪽 데이터프레임의 조인 기준으로 인덱스를 사용하지?

- right_index : 오른쪽 동일

- how : 조인 방법을 결정 기본값은 'inner'

## on

In [9]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,3], "C":[9,10,11]})

In [10]:
pd.merge(df1,df2, on = 'A') #공통된 값이 A이다.

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [11]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,4], "C":[9,10,11]})

In [12]:
pd.merge(df1,df2, on = 'A') #공통된 값만 보여준다.

   A  B   C
0  1  4   9
1  2  5  10

## join하고 싶은 컬럼이 2개 이상인 경우는?

In [19]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,4], "C":[9,10,11],'D':[500,600,700]})

In [20]:
pd.merge(df1,df2,on=['A','C']) 
#공통 컬럼을 지정하고 해달 컬럼의 값이 동일해야한다.

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

In [ ]:
pd.merge(df1,df2,on=['C','A']) #순서 바꿔도 오케이! 우선 순위는 없다!

In [3]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,3], "C":[9,10,11],'D':[500,600,700]})

In [4]:
pd.merge(df1,df2,on=['A','C'])  # A,C 둘다 공통된 값을 가져야한다.

   A  B   C    D
0  1  4   9  500
1  2  5  10  600
2  3  6  11  700

In [ ]:
#A의 값은 다 같은데? C는 두 개만 같다!? 
# on 의 컬럼의 값이 공통적으로 모두 같아야 한다.

## left_on, right_on 인자

In [32]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'A':[1,3,4], "C":[9,10,11],'D':[500,600,700]})

In [8]:
df2.rename({'A':'abc'},axis=1,inplace=True) 
# df2 'A'열 이름을 'abc'로 바꾼다.

In [9]:
df2

   abc   C    D
0    1   9  500
1    2  10  600
2    3  11  700

In [10]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [7]:
pd.merge(df1,df2,left_on=['A'],right_on=['abc'])

   A  B  C_x  abc  C_y    D
0  1  4    9    1    9  500
1  2  5   10    2   10  600
2  3  6   11    3   11  700

In [12]:
pd.merge(df2,df1,left_on=['abc'],right_on=['A'])

   abc  C_x    D  A  B  C_y
0    1    9  500  1  4    9
1    2   10  600  2  5   10
2    3   11  700  3  6   11

### 두 개 이상의 컬럼을 이용하여 병합을 해보자!

In [13]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [14]:
df2

   abc   C    D
0    1   9  500
1    2  10  600
2    3  11  700

In [19]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [20]:
pd.merge(df1,df2,left_on=['A','C'],right_on=['abc','efg'])

   A  B  C  abc  efg    D
0  1  4  9    1    9  500

In [21]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,2,4], "efg":[9,10,11],'D':[500,600,700]})

In [22]:
pd.merge(df1,df2,left_on=['A','C'],right_on=['abc','efg'])

   A  B   C  abc  efg    D
0  1  4   9    1    9  500
1  2  5  10    2   10  600

### left_index, right_index

In [23]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [24]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [25]:
df1.set_index('A', inplace=True)

In [26]:
df1

   B   C
A
1  4   9
2  5  10
3  6  11

In [28]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [27]:
pd.merge(df1,df2,left_index = True, right_on ='abc')

   B   C  abc  efg    D
0  4   9    1    9  500
1  6  11    3   10  600

In [31]:
df1 = pd.DataFrame({'A':[10,20,30], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [32]:
df1

    A  B   C
0  10  4   9
1  20  5  10
2  30  6  11

In [33]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [34]:
df1.set_index('A',inplace=True)

In [35]:
df1

    B   C
A
10  4   9
20  5  10
30  6  11

In [38]:
pd.merge(df1,df2,left_index=True, right_on='abc')

Empty DataFrame
Columns: [B, C, abc, efg, D]
Index: []

### how
- how 조인 방법을 설정할 수 있다.
- inner : 교집합의 개념
- left : 왼쪽 데이터프레임 조인 키를 기준으로 병합
- right : 오른쪽 데이터프레임 조인 키를 기준으로 병합
- outer : 왼쪽과 오른쪽 데이터프레임의 조인 키에 대한 합집합 기준으로 병합

In [39]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3]})
df2 = pd.DataFrame({'A':[2,3,4], 'y':[2,3,4]})

In [40]:
df1

   A  x
0  1  1
1  2  2
2  3  3

In [41]:
df2

   A  y
0  2  2
1  3  3
2  4  4

In [42]:
# how 병합
pd.merge(df1,df2,on='A',how='inner') # 교집합의 개념!!

   A  x  y
0  2  2  2
1  3  3  3

In [43]:
pd.merge(df1,df2,on='A',how='left')

   A  x    y
0  1  1  NaN
1  2  2  2.0
2  3  3  3.0

In [44]:
pd.merge(df1, df2, on='A',how='right')

   A    x  y
0  2  2.0  2
1  3  3.0  3
2  4  NaN  4

In [45]:
pd.merge(df1, df2, on='A',how='outer')

   A    x    y
0  1  1.0  NaN
1  2  2.0  2.0
2  3  3.0  3.0
3  4  NaN  4.0

In [46]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3],'c':[10,20,30]})
df2 = pd.DataFrame({'A':[2,3,4], 'x':[2,7,4],'d':[100,200,300]})

In [47]:
df1

   A  x   c
0  1  1  10
1  2  2  20
2  3  3  30

In [48]:
df2

   A  x    d
0  2  2  100
1  3  7  200
2  4  4  300

In [49]:
pd.merge(df1,df2,on=['A','x'],how='inner')

   A  x   c    d
0  2  2  20  100